#### 1 Working With Series 
#### 2 Working With DataFrame

# 1 Working With Series

In [7]:
# empty sereis
import pandas as pd 
import numpy as np

pd.Series()

Series([], dtype: object)

In [4]:
# creating series from list 

age = [10,20, 30, 40, 50]

age_ser = pd.Series(age)
age_ser

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
# creating sereis from dictionary 
name_dict = {
    'a': 'Noor',
    'b': 'Jhon',
    'c': 'Sara'
}

pd.Series(name_dict)

a    Noor
b    Jhon
c    Sara
dtype: object

In [6]:
# creating sereis from scaler values
pd.Series(0, index=[1,2,3,4])

1    0
2    0
3    0
4    0
dtype: int64

In [12]:
# creating series with numpy functions 
print("With linspace :\n ", pd.Series(np.linspace(0,100,5)))
print("\n with arange :\n", pd.Series(np.arange(10)))
print("\n with array :\n",pd.Series(np.array([0,2,3,4])))

With linspace :
  0      0.0
1     25.0
2     50.0
3     75.0
4    100.0
dtype: float64

 with arange :
 0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

 with array :
 0    0
1    2
2    3
3    4
dtype: int64

# 2. Working With Dataframe

In [17]:
letters = ['a','b','c','d','e']

data = pd.DataFrame(data=letters, columns=['letters'])
data

  letters
0       a
1       b
2       c
3       d
4       e

In [19]:
mydict = {
    'name':['noor','raza','shazia'],
    'Age':[10,20,30],
    'gender':['male','male','female']
}

df = pd.DataFrame(mydict)
df

     name  Age  gender
0    noor   10    male
1    raza   20    male
2  shazia   30  female

In [20]:
# selecting columns
df['name']

0      noor
1      raza
2    shazia
Name: name, dtype: object

In [21]:
# filtering 
df[df['Age'] > 20]

     name  Age  gender
2  shazia   30  female